src/Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОбъёмыПродаж</xr:Item>
				<xr:Item>InformationRegister.ЦеныПокупателей</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРеализации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/РеализацияТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЦены(ОбновляемыеТовары, Дата, ВидЦены, ДанныеОтбора = Неопределено) Экспорт

	Цены = Новый Массив();
	Если ДанныеОтбора = Неопределено Тогда
		ДанныеОтбора = Новый Структура()
	КонецЕсли;
	НужныйВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(ВидЦены);
	ДанныеОтбора.Вставить("ВидЦены", НужныйВидЦены);	
	
	ДанныеРегистра = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(Дата,ДанныеОтбора);
	
	Для Каждого Строка Из ОбновляемыеТовары Цикл
		Если ТипЗнч(Строка) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Товар = Строка.Номенклатура;
		Иначе
			Товар = Строка;
		КонецЕсли;
		Строка = ДанныеРегистра.Найти(Товар, "Номенклатура");
		Если Строка <> Неопределено  Тогда
			Цены.Добавить(Строка.Цена);
		Иначе
			Цены.Добавить(0);
		КонецЕсли;
	КонецЦикла;
	Возврат Цены;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидЦеныИзСклада(Склад) Экспорт
	Если ЗначениеЗаполнено(Склад) Тогда
		Если СтрЗаканчиваетсяНа(Склад,"ый") Тогда 
			НаименованиеВидаЦены = Лев(Склад, СтрДлина(Склад)-2);
			НаименованиеВидаЦены = НаименованиеВидаЦены + "ая";
		Иначе
			НаименованиеВидаЦены = "Розничная";
		КонецЕсли;
	Иначе
		НаименованиеВидаЦены = "Розничная";
	КонецЕсли;
	Возврат НаименованиеВидаЦены;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстантыРассчитыватьСтоимость()
	Возврат Константы.РассчитыватьСтоимостьАвтоматически.Получить();
КонецФункции

&НаКлиенте
Процедура ОбновитьСтоимость(Товар)
	Если ПолучитьЗначениеКонстантыРассчитыватьСтоимость() Тогда
        //Товар.Стоимость = Товар.ЦенаРеализации * Товар.Количество;
        Товар.Стоимость = РасчетыКлиентСервер.РассчитатьСтоимость(Товар.ЦенаРеализации, Товар.Количество);
    КонецЕсли;
КонецПроцедуры
 

&НаКлиенте
Процедура ОбновитьВсеСтоимость()
	Для Каждого Товар Из Объект.Товары Цикл
		ОбновитьСтоимость(Товар);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	ОбновляемыеТовары = Новый Массив();
	ОбновляемыеТовары.Добавить(Товар.Номенклатура);
	ДанныеОтбора = Новый Структура();
	ДанныеОтбора.Вставить("Номенклатура", Товар.Номенклатура);
	
	Цены = ПолучитьЦены(ОбновляемыеТовары, Объект.Дата, ВидЦеныИзСклада(Объект.Склад), ДанныеОтбора);
	
	Товар.ЦенаРеализации = Цены[0];
	ОбновитьСтоимость(Товар);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	ОбновитьСтоимость(Товар);
КонецПроцедуры

&НаСервере
Процедура ЗаказПриИзмененииНаСервере(Дата)
	Заказ = Объект.Заказ;
	
	Объект.Покупатель = Заказ.Покупатель;	
	Объект.Склад	  = Заказ.Склад;
	
	Объект.Товары.Очистить();
	Цены   = ПолучитьЦены(Заказ.Товары, Объект.Дата, ВидЦеныИзСклада(Объект.Склад));
	Индекс = 0;
	Для Каждого Товар Из Заказ.Товары Цикл 	
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Товар);
		НоваяСтрока.ЦенаРеализации = Цены[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ЗаказПриИзмененииНаСервере(Объект.Дата);
	ОбновитьВсеСтоимость();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЦеныТоваров()
	Товары = Объект.Товары;
	Цены   = ПолучитьЦены(Товары, Объект.Дата, ВидЦеныИзСклада(Объект.Склад));
	Индекс = 0;
	Для Каждого Товар Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Товар.Номенклатура) Тогда
			Товар.ЦенаРеализации = Цены[Индекс];
			ОбновитьСтоимость(Товар);
		КонецЕсли;
		Индекс = Индекс+1;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаРеализацииПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные;
	ОбновитьСтоимость(Товар);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьЦеныТоваров();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьЦеныТоваров();
КонецПроцедуры
